soap_collection.json

{
	"info": {
		"_postman_id": "a7975545-9e1e-4771-840d-d50d07d9d1d5",
		"name": "Task01_SOAP",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "37949159"
	},
	"item": [
		{
			"name": "Add",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <Add xmlns=\"http://tempuri.org/\">\r\n            <intA>-0</intA>\r\n            <intB>-0</intB>\r\n        </Add>\r\n    </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx?wdsl",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					],
					"query": [
						{
							"key": "wdsl",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Divide",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\r\n    <soap12:Body>\r\n        <Divide xmlns=\"http://tempuri.org/\">\r\n            <intA>49</intA>\r\n            <intB>100</intB>\r\n        </Divide>\r\n    </soap12:Body>\r\n</soap12:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx?wdsl",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					],
					"query": [
						{
							"key": "wdsl",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Multiply",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <Multiply xmlns=\"http://tempuri.org/\">\r\n            <intA>-10</intA>\r\n            <intB>12</intB>\r\n        </Multiply>\r\n    </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx?wdsl",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					],
					"query": [
						{
							"key": "wdsl",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Subtract",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soap12:Body>\r\n    <Subtract xmlns=\"http://tempuri.org/\">\r\n      <intA>-0</intA>\r\n      <intB>-133</intB>\r\n    </Subtract>\r\n  </soap12:Body>\r\n</soap12:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://www.dneonline.com/calculator.asmx?wdsl",
					"protocol": "http",
					"host": [
						"www",
						"dneonline",
						"com"
					],
					"path": [
						"calculator.asmx"
					],
					"query": [
						{
							"key": "wdsl",
							"value": null
						}
					]
				}
			},
			"response": []
		}
	]
}